content/imported/tutorials/quickstart/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;       // latest OpenFOAM
// application     pimpleDyMFoam; // OpenFOAM v1712, OpenFOAM 5.x, or older


startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             2.5;

deltaT              2.5e-2;

writeControl        adjustableRunTime;

writeInterval       2.5e-2;

purgeWrite          0;

writeFormat         ascii;

writePrecision      10;

writeCompression    off;

timeFormat          general;

timePrecision       8;

libs ("libpreciceAdapterFunctionObject.so");
functions
{
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        patches             (flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              10;
        CofR                (0 0 0);
    }

    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        errors strict; // Available since OpenFOAM v2012
    }
}
